ziyiz/DIY-Sim-Racing-FFB-Pedal-Customed/ESP32_master/src/Main.cpp
                }
                if(i==1)
                {
                  ESPNow.remove_peer(Brk_mac);
                  memcpy(&Brk_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                  delay(300);
                  ESPNow.add_peer(Brk_mac);
                  //Serial.printf("[L]Mac: %02X:%02X:%02X:%02X:%02X:%02X\n", Brk_mac[0], Brk_mac[1], Brk_mac[2], Brk_mac[3], Brk_mac[4], Brk_mac[5]);

                }
                if(i==2)
                {
                  ESPNow.remove_peer(Gas_mac);
                  memcpy(&Gas_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                  delay(300);
                  ESPNow.add_peer(Gas_mac);
                }        
                if(i==3)
                {
                  ESPNow.remove_peer(esp_Host);
                  memcpy(&esp_Host,&_ESP_pairing_reg.Pair_mac[i],6);
                  delay(300);
                  ESPNow.add_peer(esp_Host);                
                }        
              }
            }
            */
          }
          
        }
      }
    #endif
    if(configUpdateAvailable)
    {
      if(dap_config_st.payLoadHeader_.PedalTag==0)
      {
        if(dap_bridge_state_st.payloadBridgeState_.Pedal_availability[0]==1)
        {
          ESPNow.send_message(Clu_mac,(uint8_t *) &dap_config_st,sizeof(dap_config_st));
          Serial.println("[L]Clutch config sent");
          configUpdateAvailable=false;
        }
      }
      if(dap_config_st.payLoadHeader_.PedalTag==1)
      {
        if(dap_bridge_state_st.payloadBridgeState_.Pedal_availability[1]==1)
        {
          ESPNow.send_message(Brk_mac,(uint8_t *) &dap_config_st,sizeof(dap_config_st));
          Serial.println("[L]BRK config sent");
          configUpdateAvailable=false;
        }

      }
      if(dap_config_st.payLoadHeader_.PedalTag==2)
      {
        if(dap_bridge_state_st.payloadBridgeState_.Pedal_availability[2]==1)
        {
          ESPNow.send_message(Gas_mac,(uint8_t *) &dap_config_st,sizeof(dap_config_st));
          Serial.println("[L]Throttle config sent");
          configUpdateAvailable=false;
        }

      }

    }


    if(dap_action_update)
    {
      
      if(dap_actions_st.payLoadHeader_.PedalTag==0 && dap_bridge_state_st.payloadBridgeState_.Pedal_availability[0]==1)
      {
        ESPNow.send_message(Clu_mac,(uint8_t *) &dap_actions_st,sizeof(dap_actions_st));
        //Serial.println("BRK sent");
      }
      if(dap_actions_st.payLoadHeader_.PedalTag==1 && dap_bridge_state_st.payloadBridgeState_.Pedal_availability[1]==1)
      {
        ESPNow.send_message(Brk_mac,(uint8_t *) &dap_actions_st,sizeof(dap_actions_st));
        //Serial.println("BRK sent");
      }
                  
      if(dap_actions_st.payLoadHeader_.PedalTag==2 && dap_bridge_state_st.payloadBridgeState_.Pedal_availability[2]==1)
      {
        ESPNow.send_message(Gas_mac,(uint8_t *) &dap_actions_st,sizeof(dap_actions_st));
        //Serial.println("GAS sent");
      }
      
      //ESPNow.send_message(broadcast_mac,(uint8_t *) &dap_actions_st,sizeof(dap_actions_st));
      //Serial.println("Broadcast sent");
      dap_action_update=false;
    }

    delay(2);
  }
}

void Serial_Task( void * pvParameters)
{
  for(;;)
  {  
    uint16_t crc;
    uint16_t n = Serial.available();
    unsigned long current_time=millis();
    if(current_time-bridge_state_last_update>200)
    {
      basic_rssi_update=true;
      bridge_state_last_update=millis();
    }

    bool structChecker = true;
    if (n > 0)
    {
      switch (n) 
      {
        case sizeof(DAP_actions_st) :            
          Serial.readBytes((char*)&dap_actions_st, sizeof(DAP_actions_st));
          

          if ( dap_actions_st.payLoadHeader_.payloadType != DAP_PAYLOAD_TYPE_ACTION )
          { 
            structChecker = false;
            Serial.print("[L]Payload type expected: ");
            Serial.print(DAP_PAYLOAD_TYPE_ACTION);
            Serial.print(",   Payload type received: ");
            Serial.println(dap_config_st_local.payLoadHeader_.payloadType);
          }
          if ( dap_actions_st.payLoadHeader_.version != DAP_VERSION_CONFIG )
          { 
            structChecker = false;
            Serial.print("[L]Config version expected: ");
            Serial.print(DAP_VERSION_CONFIG);
            Serial.print(",   Config version received: ");
            Serial.println(dap_config_st_local.payLoadHeader_.version);
          }
          
          crc = checksumCalculator((uint8_t*)(&(dap_actions_st.payLoadHeader_)), sizeof(dap_actions_st.payLoadHeader_) + sizeof(dap_actions_st.payloadPedalAction_));
          if (crc != dap_actions_st.payloadFooter_.checkSum)
          { 
            structChecker = false;
            Serial.print("[L]CRC expected: ");
            Serial.print(crc);
            Serial.print(",   CRC received: ");
            Serial.println(dap_actions_st.payloadFooter_.checkSum);
          }
          if (structChecker == true)
          {
            dap_action_update=true;                
          }
          break;

        case sizeof(DAP_config_st):
                
          DAP_config_st * dap_config_st_local_ptr;
          dap_config_st_local_ptr = &dap_config_st;
          Serial.readBytes((char*)dap_config_st_local_ptr, sizeof(DAP_config_st));        
          // check if data is plausible          
          if ( dap_config_st.payLoadHeader_.payloadType != DAP_PAYLOAD_TYPE_CONFIG )
          { 
            structChecker = false;
            Serial.print("[L]Payload type expected: ");
            Serial.print(DAP_PAYLOAD_TYPE_CONFIG);
            Serial.print(",   Payload type received: ");
            Serial.println(dap_config_st_local.payLoadHeader_.payloadType);
          }
          if ( dap_config_st.payLoadHeader_.version != DAP_VERSION_CONFIG )
          { 
            structChecker = false;
            Serial.print("[L]Config version expected: ");
            Serial.print(DAP_VERSION_CONFIG);
            Serial.print(",   Config version received: ");
            Serial.println(dap_config_st_local.payLoadHeader_.version);
          }
              // checksum validation
          crc = checksumCalculator((uint8_t*)(&(dap_config_st.payLoadHeader_)), sizeof(dap_config_st.payLoadHeader_) + sizeof(dap_config_st.payLoadPedalConfig_));
          if (crc != dap_config_st.payloadFooter_.checkSum)
          { 
            structChecker = false;
            Serial.print("[L]CRC expected: ");
            Serial.print(crc);
            Serial.print(",   CRC received: ");
            Serial.println(dap_config_st.payloadFooter_.checkSum);
          }
          // if checks are successfull, overwrite global configuration struct
          if (structChecker == true)
          {
                //Serial.println("Updating pedal config");
            configUpdateAvailable = true;     
                //memcpy(&dap_config_st, &dap_config_st_local, sizeof(dap_config_st));     
          }
          break;

